УчетВУправляющихДляГит1/src/InformationRegisters/СтатьиЗатратПоЗарплате/СтатьиЗатратПоЗарплате.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатьиЗатратПоЗарплате</name>
  <resources>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.ПрочиеДоходыИРасходы</types>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидСтатьиЗатрат</name>
    <type>
      <types>EnumRef.ВидыДополнительныхСтатейЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатратНачисления</name>
    <type>
      <types>CatalogRef.ПрочиеДоходыИРасходы</types>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/Enums/ВидыДеятельностиДляНалоговогоУчетаЗатрат/ВидыДеятельностиДляНалоговогоУчетаЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДеятельностиДляНалоговогоУчетаЗатрат</name>
  <enumValues>
    <name>ОсновнаяСистемаНалогообложения</name>
  </enumValues>
  <enumValues>
    <name>ОсобыйПорядокНалогообложения</name>
  </enumValues>
  <enumValues>
    <name>РаспределяемыеЗатраты</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/ВидыРасходовНУ/ВидыРасходовНУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРасходовНУ</name>
  <enumValues>
    <name>АмортизационнаяПремия</name>
    <comment>Амортизационная премия (п. 1.1 ст. 259 НК РФ)</comment>
  </enumValues>
  <enumValues>
    <name>Амортизация</name>
  </enumValues>
  <enumValues>
    <name>АрендаФедеральногоИМуниципальногоИмущества</name>
  </enumValues>
  <enumValues>
    <name>ДобровольноеЛичноеСтрахование</name>
  </enumValues>
  <enumValues>
    <name>ДобровольноеЛичноеСтрахованиеНаСлучайСмертиИлиУтратыРаботоспособности</name>
  </enumValues>
  <enumValues>
    <name>ДобровольноеСтрахованиеПоДоговорамДолгосрочногоСтрахованияЖизниРаботников</name>
  </enumValues>
  <enumValues>
    <name>ЕСН</name>
  </enumValues>
  <enumValues>
    <name>КомандировочныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>МатериальныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>НалогиИСборы</name>
  </enumValues>
  <enumValues>
    <name>НеУчитываемыеВЦеляхНалогообложения</name>
  </enumValues>
  <enumValues>
    <name>НИОКР</name>
  </enumValues>
  <enumValues>
    <name>НИОКРПоПеречнюПравительстваРФ</name>
  </enumValues>
  <enumValues>
    <name>ОбязательноеИДобровольноеСтрахованиеИмущества</name>
  </enumValues>
  <enumValues>
    <name>ОплатаТруда</name>
  </enumValues>
  <enumValues>
    <name>ОсвоениеПриродныхРесурсов</name>
  </enumValues>
  <enumValues>
    <name>ПредставительскиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>РасходыНаВозмещениеЗатратРаботниковПоУплатеПроцентов</name>
  </enumValues>
  <enumValues>
    <name>РасходыНаРекламуНормируемые</name>
  </enumValues>
  <enumValues>
    <name>РемонтОсновныхСредств</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы</name>
  </enumValues>
  <enumValues>
    <name>ТранспортныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>ТорговыйСбор</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/ВидыДополнительныхСтатейЗатрат/ВидыДополнительныхСтатейЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДополнительныхСтатейЗатрат</name>
  <enumValues>
    <name>ЕСН</name>
  </enumValues>
  <enumValues>
    <name>ПФР</name>
  </enumValues>
  <enumValues>
    <name>ФСС_НС</name>
  </enumValues>
  <enumValues>
    <name>ФСС_БЛ</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы</name>
  </enumValues>
  <enumValues>
    <name>ПособияЗаСчетРаботодателя</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Catalogs/СтатьиЗатрат/СтатьиЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиЗатрат</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>АмортизационнаяПремия</name>
      <description>Амортизационная премия</description>
    </items>
    <items>
      <name>КомандировочныеРасходы</name>
      <description>Командировочные расходы</description>
    </items>
    <items>
      <name>НеамортизируемоеИмущество</name>
      <description>Неамортизируемое имущество</description>
    </items>
    <items>
      <name>ОплатаТруда</name>
      <description>Оплата труда</description>
    </items>
    <items>
      <name>ОплатаТрудаЕНВД</name>
      <description>Оплата труда (ЕНВД)</description>
    </items>
    <items>
      <name>ПрочиеЗатраты</name>
      <description>Прочие затраты</description>
    </items>
    <items>
      <name>СписаниеМатериалов</name>
      <description>Списание материалов</description>
    </items>
    <items>
      <name>СписаниеНДСНаРасходы</name>
      <description>Списание НДС</description>
    </items>
    <items>
      <name>СписаниеНДСНаРасходыЕНВД</name>
      <description>Списание НДС (ЕНВД)</description>
    </items>
    <items>
      <name>УслугиКомиссионеров</name>
      <description>Услуги комиссионеров</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидДеятельностиДляНалоговогоУчетаЗатрат</name>
    <type>
      <types>EnumRef.ВидыДеятельностиДляНалоговогоУчетаЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасходовНУ</name>
    <type>
      <types>EnumRef.ВидыРасходовНУ</types>
    </type>
  </attributes>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/InformationRegisters/СтатьиЗатратПоЗарплате/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗаполнитьСоответствияСтатейЗатратПоЗарплате() Экспорт
	
	Если НЕ УчетЗарплаты.ВключенаПодсистемаУчетаЗарплатыИКадров() Тогда
		Возврат;
	КонецЕсли;
	
	/////////////////////////////////////////////////////////////
	// Страховые взносы.
	/////////////////////////////////////////////////////////////
	
	// Общее соответствие.
	СтатьяЗатратПоСтраховымВзносам = Справочники.СтатьиЗатрат.НайтиПоНаименованию("Страховые взносы", Истина);
	Если СтатьяЗатратПоСтраховымВзносам = Справочники.СтатьиЗатрат.ПустаяСсылка() Тогда
		Справочник_Менеджер = Справочники.СтатьиЗатрат;
		ЭлементСправочника = Справочник_Менеджер.СоздатьЭлемент();
		ЭлементСправочника.Наименование = "Страховые взносы";
		ЭлементСправочника.ВидДеятельностиДляНалоговогоУчетаЗатрат = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения;
		ЭлементСправочника.ВидРасходовНУ = Перечисления.ВидыРасходовНУ.СтраховыеВзносы; // См. Письмо ФНС от 7 апреля 2010 г. N 3-2-12/21.
		ЭлементСправочника.Записать();
		СтатьяЗатратПоСтраховымВзносам = ЭлементСправочника.Ссылка;
	КонецЕсли;
	
	НаборЗаписейСоответствия = РегистрыСведений.СтатьиЗатратПоЗарплате.СоздатьНаборЗаписей();
	НаборЗаписейСоответствия.Отбор.ВидСтатьиЗатрат.Установить(Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы);
	НаборЗаписейСоответствия.Отбор.СтатьяЗатратНачисления.Установить(Справочники.СтатьиЗатрат.ПустаяСсылка());
	НаборЗаписейСоответствия.Прочитать();
	Если НаборЗаписейСоответствия.Количество() = 0 Тогда
		Запись = НаборЗаписейСоответствия.Добавить();
		Запись.ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
		Запись.СтатьяЗатратНачисления = Справочники.СтатьиЗатрат.ПустаяСсылка();
		Запись.СтатьяЗатрат = СтатьяЗатратПоСтраховымВзносам;
		НаборЗаписейСоответствия.Записать();
	КонецЕсли;
	
	//Статья для основной системы налогообложения.
	СтатьяЗатратНачисления = ПредопределенныйЭлемент("ОплатаТруда");
	Если ЗначениеЗаполнено(СтатьяЗатратНачисления) Тогда
		НаборЗаписейСоответствия = РегистрыСведений.СтатьиЗатратПоЗарплате.СоздатьНаборЗаписей();
		НаборЗаписейСоответствия.Отбор.ВидСтатьиЗатрат.Установить(Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы);
		НаборЗаписейСоответствия.Отбор.СтатьяЗатратНачисления.Установить(СтатьяЗатратНачисления);
		НаборЗаписейСоответствия.Прочитать();
		Если НаборЗаписейСоответствия.Количество() = 0 Тогда
			Запись = НаборЗаписейСоответствия.Добавить();
			Запись.ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			Запись.СтатьяЗатратНачисления = СтатьяЗатратНачисления;
			Запись.СтатьяЗатрат = СтатьяЗатратПоСтраховымВзносам;
			НаборЗаписейСоответствия.Записать();
		КонецЕсли;
	КонецЕсли;
	
	//Статья для ЕНВД.
	СтатьяЗатратНачисления = ПредопределенныйЭлемент("ОплатаТрудаЕНВД");
	Если ЗначениеЗаполнено(СтатьяЗатратНачисления) Тогда
		СтатьяЗатратПоСтраховымВзносам = Справочники.СтатьиЗатрат.НайтиПоНаименованию("Страховые взносы (ЕНВД)", Истина);
		Если СтатьяЗатратПоСтраховымВзносам = Справочники.СтатьиЗатрат.ПустаяСсылка() Тогда
			Справочник_Менеджер = Справочники.СтатьиЗатрат;
			ЭлементСправочника = Справочник_Менеджер.СоздатьЭлемент();
			ЭлементСправочника.Наименование = "Страховые взносы (ЕНВД)";
			ЭлементСправочника.ВидДеятельностиДляНалоговогоУчетаЗатрат = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения;
			ЭлементСправочника.ВидРасходовНУ = Перечисления.ВидыРасходовНУ.СтраховыеВзносы;
			ЭлементСправочника.Записать();
			СтатьяЗатратПоСтраховымВзносам = ЭлементСправочника.Ссылка;
		КонецЕсли;
		НаборЗаписейСоответствия = РегистрыСведений.СтатьиЗатратПоЗарплате.СоздатьНаборЗаписей();
		НаборЗаписейСоответствия.Отбор.ВидСтатьиЗатрат.Установить(Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы);
		НаборЗаписейСоответствия.Отбор.СтатьяЗатратНачисления.Установить(СтатьяЗатратНачисления);
		НаборЗаписейСоответствия.Прочитать();
		Если НаборЗаписейСоответствия.Количество() = 0 Тогда
			Запись = НаборЗаписейСоответствия.Добавить();
			Запись.ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.СтраховыеВзносы;
			Запись.СтатьяЗатратНачисления = СтатьяЗатратНачисления;
			Запись.СтатьяЗатрат = СтатьяЗатратПоСтраховымВзносам;
			НаборЗаписейСоответствия.Записать();
		КонецЕсли;
	КонецЕсли;
	
	/////////////////////////////////////////////////////////////
	// ФСС НС и ПЗ.
	/////////////////////////////////////////////////////////////
	
	// Общее соответствие.
	СтатьяЗатратПоФСС_НС = Справочники.СтатьиЗатрат.НайтиПоНаименованию("Взносы в ФСС от НС и ПЗ", Истина);
	Если СтатьяЗатратПоФСС_НС = Справочники.СтатьиЗатрат.ПустаяСсылка() Тогда
		Справочник_Менеджер = Справочники.СтатьиЗатрат;
		ЭлементСправочника = Справочник_Менеджер.СоздатьЭлемент();
		ЭлементСправочника.Наименование = "Взносы в ФСС от НС и ПЗ";
		ЭлементСправочника.ВидДеятельностиДляНалоговогоУчетаЗатрат = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения;
		ЭлементСправочника.ВидРасходовНУ = Перечисления.ВидыРасходовНУ.ПрочиеРасходы;
		ЭлементСправочника.Записать();
		СтатьяЗатратПоФСС_НС = ЭлементСправочника.Ссылка;
	КонецЕсли;
	
	НаборЗаписейСоответствия = РегистрыСведений.СтатьиЗатратПоЗарплате.СоздатьНаборЗаписей();
	НаборЗаписейСоответствия.Отбор.ВидСтатьиЗатрат.Установить(Перечисления.ВидыДополнительныхСтатейЗатрат.ФСС_НС);
	НаборЗаписейСоответствия.Отбор.СтатьяЗатратНачисления.Установить(Справочники.СтатьиЗатрат.ПустаяСсылка());
	НаборЗаписейСоответствия.Прочитать();
	Если НаборЗаписейСоответствия.Количество() = 0 Тогда
		Запись = НаборЗаписейСоответствия.Добавить();
		Запись.ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.ФСС_НС;
		Запись.СтатьяЗатратНачисления = Справочники.СтатьиЗатрат.ПустаяСсылка();
		Запись.СтатьяЗатрат = СтатьяЗатратПоФСС_НС;
		НаборЗаписейСоответствия.Записать();
	КонецЕсли;
	
	//Статья для основной стистемы налогообложения.
	СтатьяЗатратНачисления = ПредопределенныйЭлемент("ОплатаТруда");
	Если ЗначениеЗаполнено(СтатьяЗатратНачисления) Тогда
		НаборЗаписейСоответствия = РегистрыСведений.СтатьиЗатратПоЗарплате.СоздатьНаборЗаписей();
		НаборЗаписейСоответствия.Отбор.ВидСтатьиЗатрат.Установить(Перечисления.ВидыДополнительныхСтатейЗатрат.ФСС_НС);
		НаборЗаписейСоответствия.Отбор.СтатьяЗатратНачисления.Установить(СтатьяЗатратНачисления);
		НаборЗаписейСоответствия.Прочитать();
		Если НаборЗаписейСоответствия.Количество() = 0 Тогда
			Запись = НаборЗаписейСоответствия.Добавить();
			Запись.ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.ФСС_НС;
			Запись.СтатьяЗатратНачисления = СтатьяЗатратНачисления;
			Запись.СтатьяЗатрат = СтатьяЗатратПоФСС_НС;
			НаборЗаписейСоответствия.Записать();
		КонецЕсли;
	КонецЕсли;
	
	//Статья для ЕНВД.
	СтатьяЗатратНачисления = ПредопределенныйЭлемент("ОплатаТрудаЕНВД");
	Если ЗначениеЗаполнено(СтатьяЗатратНачисления) Тогда
		СтатьяЗатратПоФСС_НС = Справочники.СтатьиЗатрат.НайтиПоНаименованию("Взносы в ФСС от НС и ПЗ (ЕНВД)", Истина);
		Если СтатьяЗатратПоФСС_НС = Справочники.СтатьиЗатрат.ПустаяСсылка() Тогда
			Справочник_Менеджер = Справочники.СтатьиЗатрат;
			ЭлементСправочника = Справочник_Менеджер.СоздатьЭлемент();
			ЭлементСправочника.Наименование = "Взносы в ФСС от НС и ПЗ (ЕНВД)";
			ЭлементСправочника.ВидДеятельностиДляНалоговогоУчетаЗатрат = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения;
			ЭлементСправочника.ВидРасходовНУ = Перечисления.ВидыРасходовНУ.ПрочиеРасходы;
			ЭлементСправочника.Записать();
			СтатьяЗатратПоФСС_НС = ЭлементСправочника.Ссылка;
		КонецЕсли;
		НаборЗаписейСоответствия = РегистрыСведений.СтатьиЗатратПоЗарплате.СоздатьНаборЗаписей();
		НаборЗаписейСоответствия.Отбор.ВидСтатьиЗатрат.Установить(Перечисления.ВидыДополнительныхСтатейЗатрат.ФСС_НС);
		НаборЗаписейСоответствия.Отбор.СтатьяЗатратНачисления.Установить(СтатьяЗатратНачисления);
		НаборЗаписейСоответствия.Прочитать();
		Если НаборЗаписейСоответствия.Количество() = 0 Тогда
			Запись = НаборЗаписейСоответствия.Добавить();
			Запись.ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.ФСС_НС;
			Запись.СтатьяЗатратНачисления = СтатьяЗатратНачисления;
			Запись.СтатьяЗатрат = СтатьяЗатратПоФСС_НС;
			НаборЗаписейСоответствия.Записать();
		КонецЕсли;
	КонецЕсли;
	
	/////////////////////////////////////////////////////////////
	// Больничный за счет работодателя (НК РФ ст. 264 п 48/1).
	/////////////////////////////////////////////////////////////
	
	// Общее соответствие.
	СтатьяЗатратПособияЗаСчетРаботодателя = Справочники.СтатьиЗатрат.НайтиПоНаименованию("Оплата больничного", Истина);
	Если СтатьяЗатратПособияЗаСчетРаботодателя = Справочники.СтатьиЗатрат.ПустаяСсылка() Тогда
		Справочник_Менеджер = Справочники.СтатьиЗатрат;
		ЭлементСправочника = Справочник_Менеджер.СоздатьЭлемент();
		ЭлементСправочника.Наименование = "Оплата больничного";
		ЭлементСправочника.ВидДеятельностиДляНалоговогоУчетаЗатрат = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения;
		ЭлементСправочника.ВидРасходовНУ = Перечисления.ВидыРасходовНУ.ПрочиеРасходы;
		ЭлементСправочника.Записать();
		СтатьяЗатратПособияЗаСчетРаботодателя = ЭлементСправочника.Ссылка;
	КонецЕсли;
	
	НаборЗаписейСоответствия = РегистрыСведений.СтатьиЗатратПоЗарплате.СоздатьНаборЗаписей();
	НаборЗаписейСоответствия.Отбор.ВидСтатьиЗатрат.Установить(Перечисления.ВидыДополнительныхСтатейЗатрат.ПособияЗаСчетРаботодателя);
	НаборЗаписейСоответствия.Отбор.СтатьяЗатратНачисления.Установить(Справочники.СтатьиЗатрат.ПустаяСсылка());
	НаборЗаписейСоответствия.Прочитать();
	Если НаборЗаписейСоответствия.Количество() = 0 Тогда
		Запись = НаборЗаписейСоответствия.Добавить();
		Запись.ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.ПособияЗаСчетРаботодателя;
		Запись.СтатьяЗатратНачисления = Справочники.СтатьиЗатрат.ПустаяСсылка();
		Запись.СтатьяЗатрат = СтатьяЗатратПособияЗаСчетРаботодателя;
		НаборЗаписейСоответствия.Записать();
	КонецЕсли;
	
	//Статья для основной стистемы налогообложения.
	СтатьяЗатратНачисления = ПредопределенныйЭлемент("ОплатаТруда");
	Если ЗначениеЗаполнено(СтатьяЗатратНачисления) Тогда
		НаборЗаписейСоответствия = РегистрыСведений.СтатьиЗатратПоЗарплате.СоздатьНаборЗаписей();
		НаборЗаписейСоответствия.Отбор.ВидСтатьиЗатрат.Установить(Перечисления.ВидыДополнительныхСтатейЗатрат.ПособияЗаСчетРаботодателя);
		НаборЗаписейСоответствия.Отбор.СтатьяЗатратНачисления.Установить(СтатьяЗатратНачисления);
		НаборЗаписейСоответствия.Прочитать();
		Если НаборЗаписейСоответствия.Количество() = 0 Тогда
			Запись = НаборЗаписейСоответствия.Добавить();
			Запись.ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.ПособияЗаСчетРаботодателя;
			Запись.СтатьяЗатратНачисления = СтатьяЗатратНачисления;
			Запись.СтатьяЗатрат = СтатьяЗатратПособияЗаСчетРаботодателя;
			НаборЗаписейСоответствия.Записать();
		КонецЕсли;
	КонецЕсли;
	
	//Статья для ЕНВД.
	СтатьяЗатратНачисления = ПредопределенныйЭлемент("ОплатаТрудаЕНВД");
	Если ЗначениеЗаполнено(СтатьяЗатратНачисления) Тогда
		СтатьяЗатратПособияЗаСчетРаботодателя = Справочники.СтатьиЗатрат.НайтиПоНаименованию("Оплата больничного (ЕНВД)", Истина);
		Если СтатьяЗатратПособияЗаСчетРаботодателя = Справочники.СтатьиЗатрат.ПустаяСсылка() Тогда
			Справочник_Менеджер = Справочники.СтатьиЗатрат;
			ЭлементСправочника = Справочник_Менеджер.СоздатьЭлемент();
			ЭлементСправочника.Наименование = "Оплата больничного (ЕНВД)";
			ЭлементСправочника.ВидДеятельностиДляНалоговогоУчетаЗатрат = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения;
			ЭлементСправочника.ВидРасходовНУ = Перечисления.ВидыРасходовНУ.ПрочиеРасходы;
			ЭлементСправочника.Записать();
			СтатьяЗатратПособияЗаСчетРаботодателя = ЭлементСправочника.Ссылка;
		КонецЕсли;
		НаборЗаписейСоответствия = РегистрыСведений.СтатьиЗатратПоЗарплате.СоздатьНаборЗаписей();
		НаборЗаписейСоответствия.Отбор.ВидСтатьиЗатрат.Установить(Перечисления.ВидыДополнительныхСтатейЗатрат.ПособияЗаСчетРаботодателя);
		НаборЗаписейСоответствия.Отбор.СтатьяЗатратНачисления.Установить(СтатьяЗатратНачисления);
		НаборЗаписейСоответствия.Прочитать();
		Если НаборЗаписейСоответствия.Количество() = 0 Тогда
			Запись = НаборЗаписейСоответствия.Добавить();
			Запись.ВидСтатьиЗатрат = Перечисления.ВидыДополнительныхСтатейЗатрат.ПособияЗаСчетРаботодателя;
			Запись.СтатьяЗатратНачисления = СтатьяЗатратНачисления;
			Запись.СтатьяЗатрат = СтатьяЗатратПособияЗаСчетРаботодателя;
			НаборЗаписейСоответствия.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Функция получения предопределнного элемента по имени
// Используется для исключения влияния повторного использования в стандартном механизме
Функция ПредопределенныйЭлемент(ИмяПредопределенногоЭлемента)

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 
	                |	Ссылка 
	                |ИЗ
	                |	Справочник.СтатьиЗатрат 
	                |ГДЕ
	                |	ИмяПредопределенныхДанных = &ИмяПредопределенныхДанных";
	Запрос.УстановитьПараметр("ИмяПредопределенныхДанных", ИмяПредопределенногоЭлемента);
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Возврат Неопределено;
	
	Иначе
		
		Возврат Результат.Выгрузить()[0].Ссылка;
	
	КонецЕсли; 

КонецФункции // ПредопределенныйЭлемент()

#КонецЕсли
